Repository: interesta22/prtfolio
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Portfolio
ar: بورتفوليو

# about
source: About Me
ar: عني

source: Education
ar: التعليم

source: Skills
ar: المهارات

# work
source: Work Experience
ar: الخبرات

source: Services
ar: الخدمات

source: Projects
ar: المشاريع

# contact
source: Contact Me
ar: اتصل بي

source: Language
ar: اللغة

# heroTitle
source: Ahmed Abdul Aziz
ar: أحمد عبدالعزيز

source: Mobile App Developer
ar: مطور تطبيقات موبايل

# heroDescription
source: Building scalable, user-friendly mobile applications with Flutter, Firebase, and modern state management. Passionate about clean architecture, performance optimization, and delivering real-world solutions.
ar: مطور تطبيقات موبايل متخصص في Flutter وFirebase وواجهات برمجة REST، بخبرة في بناء تطبيقات قابلة للتوسع وسهلة الاستخدام. شغوف بالهندسة النظيفة، تحسين الأداء، وتقديم حلول عملية تخدم المستخدمين.

source: Cooperation Request
ar: طلب تعاون

# aboutTitle
source: About Me
ar: من أنا

# aboutParagraph
source: My journey into tech started with my Computer Science studies at Kafr El-Sheikh University, after transferring from Luxor University.Over the past years, I’ve gained hands-on experience through training with the Digital Egypt Pioneers Initiative (DEPI) and the Information Technology Institute (ITI), where I built real-world mobile apps using Flutter, Dart, Firebase, and REST APIs. I also worked with state management patterns like Cubit and Bloc, and focused on delivering clean, scalable, and maintainable code.Beyond coding, I value teamwork, communication, and problem-solving skills I strengthened while collaborating on projects and mentoring peers.What sets me apart? I don’t just build apps, I build experiences.
ar: أنا أحمد عبد العزيز، مطور تطبيقات Flutter وموبايل من مصر. بدأت رحلتي في مجال التقنية بدراسة علوم الحاسب في جامعة كفر الشيخ بعد انتقالي من جامعة الأقصر. خلال السنوات الماضية اكتسبت خبرة عملية من خلال تدريبي في مبادرة مصر الرقمية (DEPI) ومعهد تكنولوجيا المعلومات (ITI)، حيث طورت تطبيقات حقيقية باستخدام Flutter، Dart، Firebase، وREST APIs. كمان اشتغلت على أنماط إدارة الحالة زي Cubit وBloc، وركزت على كتابة كود نظيف، قابل للتوسّع، وسهل الصيانة. بعيدًا عن الكود، بقدّر أهمية العمل الجماعي، التواصل، وحل المشكلات — مهارات طورتها من خلال المشاريع التعاونية وتجارب التدريب. إيه اللي بيميزني؟ أنا مش ببني تطبيقات وبس، أنا ببني تجارب.

source: Soft Skills
ar: المهارات الشخصية

source: Technical Skills
ar: المهارات التقنية

source: Teamwork
ar: العمل الجماعي

# communication
source: Communication Skills
ar: مهارات التواصل

source: Presentation
ar: العرض والتقديم

source: Time Management
ar: إدارة الوقت

source: Remote Collaboration
ar: التعاون عن بعد

source: Adaptability
ar: القدرة على التكيف

source: Team Leadership
ar: قيادة الفريق

source: Problem Solving
ar: حل المشكلات

source: Critical Thinking
ar: التفكير النقدي

source: Self-Learning
ar: التعلم الذاتي

source: OOP
ar: البرمجة الكائنية OOP

source: Data Structures
ar: هياكل البيانات

source: Algorithms
ar: الخوارزميات

source: SOLID Principles
ar: مبادئ SOLID

# teamworksubtitle
source: Ability to collaborate effectively with a team to achieve goals
ar: القدرة على التعاون مع الفريق لتحقيق أهداف مشتركة

# communicationsubtitle
source: Effective communication with colleagues and clients
ar: التواصل الفعال مع الزملاء والعملاء

# presentationsubtitle
source: Ability to present ideas clearly and persuasively
ar: قدرة على تقديم الأفكار بوضوح وإقناع الجمهور

# time_managementsubtitle
source: Organizing time to complete tasks efficiently
ar: تنظيم الوقت لإنجاز المهام بكفاءة

# remote_collaborationsubtitle
source: Ability to work with remote teams
ar: القدرة على العمل مع فرق بعيدة عنك

# adaptabilitysubtitle
source: Quickly adapting to changes and new situations
ar: التكيف مع التغييرات والمواقف الجديدة بسرعة

# team_leadershipsubtitle
source: Guiding and managing a team to achieve best performance
ar: توجيه وإدارة فريق لتحقيق أفضل أداء

# problem_solvingsubtitle
source: Analyzing problems and finding effective solutions
ar: تحليل المشاكل وإيجاد حلول فعالة

# critical_thinkingsubtitle
source: Analyzing information to make informed decisions
ar: تحليل المعلومات واتخاذ قرارات مستنيرة

# self_learningsubtitle
source: Ability to acquire new skills independently
ar: القدرة على اكتساب مهارات جديدة بشكل مستقل

# dartsubtitle
source: Proficient in Dart for building high-performance apps
ar: التمكن من لغة البرمجة Dart لبناء تطبيقات عالية الأداء

# fluttersubtitle
source: Developing mobile and web apps using Flutter
ar: تطوير تطبيقات موبايل وويب باستخدام Flutter

# firebasesubtitle
source: Working with Firebase database, authentication, and services
ar: التعامل مع قاعدة البيانات والمصادقة وخدمات Firebase المختلفة

# cppsubtitle
source: Proficient in C++ for object-oriented and structured programming
ar: التمكن من البرمجة الكائنية والهيكلية باستخدام C++

# csharpsubtitle
source: Developing applications using C# and .NET Framework
ar: تطوير التطبيقات باستخدام لغة C# و.NET Framework

# pythonsubtitle
source: Writing scripts and programs using Python
ar: كتابة سكريبتات وبرامج باستخدام Python

# oopsubtitle
source: Designing software using Object-Oriented Programming principles
ar: تصميم البرمجيات باستخدام المفاهيم الكائنية

# data_structuressubtitle
source: Organizing data efficiently for better program performance
ar: تنظيم البيانات بكفاءة لأداء أفضل للبرامج

# algorithmssubtitle
source: Solving problems using efficient algorithms
ar: حل المشكلات باستخدام خوارزميات فعالة

# solid_principlessubtitle
source: Writing maintainable and scalable code following SOLID principles
ar: كتابة كود قابل للصيانة والتوسع وفق مبادئ SOLID

# design_patternssubtitle
source: Applying design patterns to improve code structure
ar: استخدام الأنماط التصميمية لتحسين بنية الكود

# cubitsubtitle
source: State management in Flutter using Cubit
ar: إدارة الحالة في Flutter باستخدام Cubit

# blocsubtitle
source: State management in Flutter using Bloc pattern
ar: إدارة الحالة في Flutter باستخدام Bloc Pattern

# clean_architecturesubtitle
source: Designing applications in a clean and organized way
ar: تصميم التطبيق بطريقة نظيفة ومنظمة

# mvvmsubtitle
source: Using MVVM pattern to separate UI and logic
ar: استخدام نموذج MVVM لتقسيم واجهة المستخدم والمنطق

# deadbot_short
source: AI app that answers your questions and solves problems, with free image uploads.
ar: تطبيق ذكاء اصطناعي يرد على أسئلتك ويحللك مشاكل، مع رفع الصور مجاناً.

# deadbot_long
source: An advanced AI app using large language models (LLM) to provide accurate answers to your questions and solutions to your problems. The app features an easy-to-use interface, free image upload support, and cloud integration to ensure high performance and reliability.
ar: تطبيق ذكاء اصطناعي متقدم يستخدم نماذج لغة كبيرة (LLM) لتقديم إجابات دقيقة على أسئلتك وحلول لمشاكلك. يتميز التطبيق بواجهة مستخدم سهلة الاستخدام، دعم رفع الصور مجاناً، وتكامل مع خدمات سحابية لضمان أداء عالي وموثوقية.

# k3_short
source: App to calculate transport fares and split expenses accurately.
ar: تطبيق لحساب أجر المواصلات وتقسيم المصاريف بدقة.

# k3_long
source: Khalyha Alena helps you calculate public transport fares among friends, records who paid what, and computes who owes or is owed money. It also provides efficient travel routes to organize daily expenses or group trips effectively.
ar: خليها علينا يساعدك على حساب أجرة المواصلات العامة بينك وبين أصدقائك، يسجل من دفع وكم دفع، ويحسب من له أو عليه فلوس. كما يقدم طرق التنقل بين الأماكن بكفاءة، لتنظيم المصاريف اليومية أو الرحلات الجماعية.0

# tawseela_short
source: Transport service for students living away, at affordable and comfortable prices.
ar: خدمة مواصلات للطلاب المغتربين بأسعار مناسبة ومريحة.

# tawseela_long
source: Tawseela is an app designed to ease life for students living away from home in Egypt. It provides safe and comfortable transport between cities and governorates at reasonable prices, with the ability to track vehicles and book trips easily.
ar: توصيلة هو تطبيق لتسهيل حياة الطلاب المغتربين في مصر، يوفر رحلات مريحة وآمنة بين المدن والمحافظات بأسعار مناسبة، مع إمكانية متابعة موقع المركبة وحجز الرحلات بسهولة.

# memomate_short
source: App for safely and efficiently recording personal notes online.
ar: تطبيق تدوين المذكرات الخاصة بشكل آمن وفعال أونلاين.

# memomate_long
source: Memomate is an app for recording personal notes online in a secure and organized way. You can write daily journals, record ideas, and keep important notes accessible anytime from any device.
ar: تطبيق لتدوين المذكرات الشخصية أونلاين بطريقة آمنة ومرتبة. يمكنك كتابة يومياتك، تسجيل الأفكار، والاحتفاظ بالملاحظات المهمة مع إمكانية الوصول إليها في أي وقت ومن أي جهاز.

# aboot__
source: I'm Ahmed Abdul Aziz and
ar: أنا أحمد عبد العزيز و

# aboot___
source: Flutter Developer
ar: مطور Flutter

source: Home
ar: الرئيسية

source: Luxor University
ar: جامعة الأقصر

# faculty_computers_info
source: Faculty of Computers and Information
ar: كلية الحاسبات والمعلومات

# date_oct2022_jun2023
source: Oct 2022 - Jun 2023
ar: أكتوبر 2022 - يونيو 2023

# kfs_university
source: Kafr El-Sheikh University
ar: جامعة كفر الشيخ

source: CS Department
ar: قسم علوم الحاسب

# date_oct2023_present
source: Oct 2023 - Present
ar: أكتوبر 2023 - حتى الآن

# iti
source: Information Technology Institute
ar: معهد تكنولوجيا المعلومات

# summer_training_flutter
source: Summer Training - Flutter Track
ar: تدريب صيفي - مسار Flutter

source: Tanta Branch
ar: فرع طنطا

# date_jul2025_aug2025
source: Jul 2025 - Aug 2025
ar: يوليو 2025 - أغسطس 2025

# depi
source: Digital Egypt Pioneers Initiative
ar: مبادرة رواد مصر الرقمية

source: Flutter Track
ar: مسار Flutter

source: Alexandria
ar: الإسكندرية

# date_jul2025_present
source: Jul 2025 - Present
ar: يوليو 2025 - حتى الآن

source: View My CV
ar: رؤية السيرة الذاتية

source: Name
ar: الاسم

source: Email
ar: البريد الإلكتروني

source: Subject
ar: الموضوع

source: Message
ar: الرسالة

source: Submit
ar: إرسال

# enterName
source: Enter your name
ar: أدخل اسمك

# enterEmail
source: Enter your email
ar: أدخل بريدك الإلكتروني

# invalidEmail
source: Invalid email address
ar: البريد الإلكتروني غير صالح

source: Enter subject
ar: أدخل الموضوع

# enterMessage
source: Enter your message
ar: أدخل رسالتك

# messageSent
source: Your message has been sent successfully
ar: تم إرسال رسالتك بنجاح

# messageFailed
source: Failed to send message
ar: فشل في إرسال الرسالة

source: view
ar: عرض
